Revit 2026 API

# SolidGlassSolidglassTransmittance Property

---

The property labeled "Color" from the "SolidGlass" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SolidglassTransmittance { get; }
```
```vb
Public Shared ReadOnly Property SolidglassTransmittance As String
	Get
```
```cpp
public:
static property String^ SolidglassTransmittance {
	String^ get ();
}
```
```fsharp
static member SolidglassTransmittance : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SolidglassTransmittanceType".

#### Reference

SolidGlass Class

Autodesk.Revit.DB.Visual Namespace